package com.nineshadow.constructor;

public class Test {
    public static void main(String[] args) {
        // 目标：认识类的构造器，搞清楚其特点和常见应用场景。
        // 构造器的特点：创建对象时，对象会立即自动调用构造器
        Student s1 = new Student();
        Student s2 = new Student("西门吹雪");

        Student s3 = new Student();
        s3.name = "小龙女";
        s3.age = 18;
        s3.sex = '女';

        // System.out.println("s1:"+s1);
        // System.out.println("s2:"+s2);
        // System.out.println("s3:"+s3);

        // 对象的一种常见应用场景：创建对象时可以立即为对象赋值
        Student s4 = new Student("小龙女",18,'女');
        // System.out.println("s4:"+s4);
    }

    // 🌟🌟🌟 构造器的注意事项
    // - 类默认就自带一个无参构造器
    // - 如果自己定义了有参构造器，那么类就没有无参构造器了，此时还想用无参构造器，必须自己定义无参构造器
}
